{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features (Login component and authenticated App routing) to their source files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries for each frontend source file, describing their purpose and recent changes such as added from/to fields and authentication hooks.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "HTML entry point for the React app, mounting the root div and loading the main.tsx module script.",
  "frontend/src/App.tsx": "Root app component that conditionally renders the Login page for unauthenticated users or the full trip management UI (Header, Dashboard, TripForm, TripTable, DailyReport, Footer) for authenticated users, managing auth state via useAuth and trip state via useTripData.",
  "frontend/src/components/DailyReport.tsx": "Daily report component that filters trips by a selected date, displays summary stats and a trip details table, and provides Excel and PDF export buttons.",
  "frontend/src/components/Dashboard.tsx": "Dashboard component with all-time, daily, and monthly filter controls that displays aggregated trip statistics and a cost chart using useDashboardStats.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying the copyright year and a branded link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "App header with logo, navigation anchor links, and an optional logout button that calls the provided onLogout callback.",
  "frontend/src/components/Login.tsx": "Renders a login form with username/password fields, validates credentials via an `onLogin` callback, and displays error or loading states accordingly.",
  "frontend/src/components/TripCostChart.tsx": "Displays a grouped bar chart of trip costs (amount, extra charge, total) over time using Recharts, with a custom INR tooltip and empty-state fallback.",
  "frontend/src/components/TripForm.tsx": "Form component for creating or editing a trip record, using the `useTripForm` hook for state/validation and rendering fields for date, order ID, locations, charges, and remarks.",
  "frontend/src/components/TripTable.tsx": "Displays all trip records in a searchable table with edit and delete actions, including a confirmation dialog before deletion.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an ICP backend actor based on the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Simple authentication hook that validates hardcoded credentials, persists session state in `sessionStorage`, and exposes `login` and `logout` callbacks.",
  "frontend/src/hooks/useDashboardStats.ts": "Computes filtered trip statistics (totals for amount, extra charges, grand total) and date-aggregated chart data based on optional date or month filters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook for managing ICP Internet Identity login, logout, and identity persistence via `AuthClient`.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for React Query backend hooks; currently empty as the app uses Local Storage for persistence.",
  "frontend/src/hooks/useTripData.ts": "Custom React hook that manages trip records in localStorage, exposing addTrip, updateTrip, and deleteTrip operations with automatic date-sorted state updates.",
  "frontend/src/hooks/useTripForm.ts": "Custom React hook managing trip form state, validation (including duplicate Order ID checks), field-level error handling, and form submission logic for both add and edit modes.",
  "frontend/src/index.css": "Global stylesheet importing Inter and Plus Jakarta Sans fonts, defining Tailwind base/component/utility layers, and setting up a warm amber/brown OKLCH color palette with light and dark mode CSS variables.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/types/trip.ts": "TypeScript type definitions for TripRecord, TripFormValues, TripFormErrors, and DashboardStats used throughout the trip management app.",
  "frontend/src/utils/exportUtils.ts": "Utility functions to export trip records as a UTF-8 BOM CSV file (Excel-compatible) or as a browser-printed PDF with summary stats and styled HTML table.",
  "frontend/src/utils/formatCurrency.ts": "Utility functions for formatting numbers as Indian Rupee currency (₹), and for converting YYYY-MM-DD date strings and YYYY-MM month strings into human-readable labels.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with OKLCH-based design tokens, custom fonts (Inter, Plus Jakarta Sans), accordion animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state manifest (version 7) documenting the app summary, architectural notes, existing features, and known issues for a trip data entry and management app with local storage, dashboard, and export capabilities."
}