{
  "backend/main.mo": "Empty Motoko actor serving as the ICP backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: adding status breakdown stat cards (Pending/Completed/Cancelled) to the Dashboard component and to the DailyReport/DateRangeReport components, with associated test IDs and file paths.",
  "frontend-file-summaries.txt": "JSON map of frontend source files to short summaries describing each file's role, covering types, hooks, components, and utilities in the trip management app.",
  "frontend/index.css": "Global Tailwind CSS entry file defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "Minimal HTML shell for the React app titled 'Trip Data Manager' that mounts the app at the #root div and loads the main TSX entry point.",
  "frontend/src/App.tsx": "Root React component managing authentication, multi-page navigation (dashboard, create-trip, reports, vehicles), and wiring trip CRUD and status-change handlers from useTripData to child components.",
  "frontend/src/components/DailyReport.tsx": "Daily report component that filters trips by a selected date, displays summary stat cards and a status breakdown (Pending/Completed/Cancelled), and supports Excel/PDF export.",
  "frontend/src/components/Dashboard.tsx": "Dashboard component with All/Daily/Monthly filter controls that uses useDashboardStats to display summary stat cards, a status breakdown section, and a trip cost chart.",
  "frontend/src/components/DateRangeReport.tsx": "Renders a custom date range report UI that filters trips by selected dates, computes summary stats and status counts, and provides Excel/PDF export buttons.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying the current year copyright and a branded link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "App header with branding, a logout button, and a navigation tab bar for switching between Dashboard, Create Trip, Reports, and Vehicles pages.",
  "frontend/src/components/Login.tsx": "Login form component with username/password fields that calls an onLogin callback and displays an error message on failed authentication.",
  "frontend/src/components/TripCostChart.tsx": "Renders a grouped bar chart (via Recharts) showing Amount, Extra Charge, and Total per date, with a custom INR tooltip and empty-state fallback.",
  "frontend/src/components/TripForm.tsx": "Form component for creating or editing a trip record, using useTripForm for state/validation and useVehicleList to populate a vehicle number dropdown.",
  "frontend/src/components/TripTable.tsx": "Displays all trip records in a searchable table with inline status toggle buttons and a confirmation dialog for deleting individual records.",
  "frontend/src/components/VehicleManagement.tsx": "React component for managing a list of vehicle numbers, supporting add (with duplicate/empty validation) and delete operations using the useVehicleList hook.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Simple session-based authentication hook with hardcoded credentials, persisting auth state in sessionStorage and exposing login/logout functions.",
  "frontend/src/hooks/useDashboardStats.ts": "Hook that computes filtered trip statistics (totals, status breakdown, and chart data aggregated by date) based on optional date or month filters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing identity, login/clear functions, and login status states.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for React Query backend hooks; currently empty as the app uses localStorage exclusively.",
  "frontend/src/hooks/useTripData.ts": "Hook managing trip records persisted in localStorage, providing add, update, delete, and status-update operations with automatic date-sorted state.",
  "frontend/src/hooks/useTripForm.ts": "Hook managing trip form state, validation (including duplicate order ID checks), field change/blur handlers, and form submission to produce a TripRecord.",
  "frontend/src/hooks/useVehicleList.ts": "Hook managing a localStorage-persisted list of vehicle numbers with add (deduplication) and delete operations.",
  "frontend/src/index.css": "Global CSS file defining Tailwind base/component/utility layers, custom OKLCH color tokens for light and dark themes, and reusable component utility classes.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/types/trip.ts": "TypeScript type definitions for trip records, form values, form errors, and dashboard statistics used throughout the app.",
  "frontend/src/utils/exportUtils.ts": "Utility functions to export trip records as a CSV file (exportToExcel) or as a print-ready HTML/PDF page (exportToPDF) with INR formatting.",
  "frontend/src/utils/formatCurrency.ts": "Helper functions to format numbers as Indian Rupee currency strings and to format date/month strings into human-readable labels.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, typography/container-queries/animate plugins, and custom font families.",
  "project_state.json": "Project state snapshot describing the app's features, architecture (localStorage-based, no backend), known issues, and multi-view navigation layout for a trip management app."
}