{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting the removal of the sliding/progress bar UI element from the app's Header component, with high confidence and linked to test REQ-32.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files, describing the purpose and recent changes of each component, hook, utility, and type definition.",
  "frontend/index.css": "Global CSS file that sets up Tailwind directives and defines CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "HTML entry point for the React app, mounting the root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Main app component managing authentication state, multi-page navigation (dashboard, create-trip, reports, vehicles), trip CRUD operations, and edit flow between views.",
  "frontend/src/components/DailyReport.tsx": "Daily report component that filters trips by a selected date, displays summary stats and a trip details table with a Vehicle No. column, and supports CSV/PDF export.",
  "frontend/src/components/Dashboard.tsx": "Dashboard component with All/Daily/Monthly filter controls, summary stat cards, and a trip cost chart powered by the useDashboardStats hook.",
  "frontend/src/components/DateRangeReport.tsx": "Custom date range report component with From/To date pickers, validation, filtered trip results table including Vehicle No., summary stats, and disabled export buttons when no records match.",
  "frontend/src/components/Footer.tsx": "Renders a site footer with a copyright year and a branded link to caffeine.ai using the current hostname as a UTM parameter.",
  "frontend/src/components/Header.tsx": "Renders the app header with branding, a logout button, and a navigation tab bar for Dashboard, Create Trip, Reports, and Vehicles pages.",
  "frontend/src/components/Login.tsx": "Provides a login form with username/password fields, error display, and loading state, calling an onLogin callback to authenticate.",
  "frontend/src/components/TripCostChart.tsx": "Renders a grouped bar chart (using Recharts) showing trip amount, extra charge, and total cost over time, with INR-formatted tooltips and axis labels.",
  "frontend/src/components/TripForm.tsx": "A form component for creating or editing a trip record, with fields for date, order ID, vehicle number (dropdown), and other trip details, backed by the useTripForm hook.",
  "frontend/src/components/TripTable.tsx": "Displays all trip records in a searchable, paginated table with edit and delete actions, including a confirmation dialog before deletion.",
  "frontend/src/components/VehicleManagement.tsx": "Provides a UI to add and delete vehicle numbers from a persistent list, with duplicate validation and keyboard support, using the useVehicleList hook.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Provides simple hardcoded username/password authentication with session persistence via sessionStorage, exposing login, logout, and isAuthenticated state.",
  "frontend/src/hooks/useDashboardStats.ts": "Computes filtered trip statistics (totals for trips, amounts, extra charges) and aggregated chart data by date, based on optional date or month filter strings.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing identity, login/clear functions, and login status flags.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for React Query backend hooks; currently empty as the app uses localStorage exclusively.",
  "frontend/src/hooks/useTripData.ts": "Manages trip records with localStorage persistence, providing add, update, and delete operations with automatic date-descending sorting.",
  "frontend/src/hooks/useTripForm.ts": "Handles trip form state, validation (including duplicate order ID checks), field change/blur events, and form submission to produce a TripRecord.",
  "frontend/src/hooks/useVehicleList.ts": "Manages a persisted list of vehicle numbers in localStorage, providing add (with deduplication) and delete operations.",
  "frontend/src/index.css": "Defines global styles using Tailwind CSS with a warm amber/brown OKLCH color palette, custom CSS variables for light/dark themes, and reusable component classes for layout elements like headers, forms, and cards.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/types/trip.ts": "Defines TypeScript interfaces for TripRecord, TripFormValues, TripFormErrors, and DashboardStats used throughout the trip management feature.",
  "frontend/src/utils/exportUtils.ts": "Provides two export functions: `exportToExcel` serializes trip records to a UTF-8 CSV file and triggers a browser download, and `exportToPDF` generates a styled HTML page with a summary table and opens a print dialog for PDF saving.",
  "frontend/src/utils/formatCurrency.ts": "Utility module exporting three formatting helpers: `formatINR` for Indian Rupee currency strings, `formatDate` for converting YYYY-MM-DD to a readable date, and `formatMonth` for converting YYYY-MM to a full month-year label.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that enables dark mode via class, extends the theme with custom fonts (Inter, Plus Jakarta Sans), OKLCH-based semantic color tokens, border radii, accordion keyframes, and registers the typography, container-queries, and animate plugins.",
  "project_state.json": "Project state snapshot (version 17) describing the trip management app's architecture, existing features, and known issues, including local-storage-only persistence, hardcoded login credentials, Indian currency formatting, and a multi-view navigation layout."
}