{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add status breakdown (Pending, Complete, Cancel) to Dashboard stats and Reports view",
  "requirements": [
    {
      "id": "REQ-35",
      "summary": "Add Pending, Completed, and Cancelled trip counts to Dashboard stat cards that respect the active daily/monthly filter",
      "acceptanceCriteria": [
        "The Dashboard view displays three additional stat cards or a clearly labelled group: Pending Trips, Completed Trips, and Cancelled Trips.",
        "Each count reflects only the trips that match the current date/month filter (or all trips when no filter is active).",
        "The counts update automatically whenever trip data or the active filter changes.",
        "All existing Dashboard stat cards (Total Trips, Total Amount, Total Extra Charges, Grand Total) and the chart remain unaffected.",
        "The layout remains responsive on both mobile and desktop."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useDashboardStats.ts",
          "operation": "modify",
          "description": "Extend the DashboardStats interface to include statusBreakdown object with pendingCount, completedCount, and cancelledCount properties. Update the useDashboardStats hook to compute these three counts from filteredTrips by checking each trip's status field against 'Pending', 'Complete', and 'Cancel'. Return the statusBreakdown object alongside existing stats so the Dashboard component can consume it."
        },
        {
          "path": "frontend/src/components/Dashboard.tsx",
          "operation": "modify",
          "description": "Import and destructure the statusBreakdown object from the useDashboardStats hook result. After the existing four stat cards (Total Trips, Total Amount, Total Extra Charges, Grand Total), add a new grid section or three additional stat Card components displaying Pending Trips, Completed Trips, and Cancelled Trips using the statusBreakdown counts. Ensure the new cards respect the same responsive grid layout and styling (Card, CardHeader, CardTitle, CardContent) used by existing stat cards so the interface remains consistent across mobile and desktop viewports."
        }
      ]
    },
    {
      "id": "REQ-36",
      "summary": "Add Pending, Completed, and Cancelled trip counts to the summary section of both DailyReport and DateRangeReport views",
      "acceptanceCriteria": [
        "In DailyReport, after generating a report for a selected date, the summary section shows Pending, Completed, and Cancelled counts alongside existing stats.",
        "In DateRangeReport, after generating a report for a selected date range, the summary section shows Pending, Completed, and Cancelled counts alongside existing stats.",
        "The counts are computed from the same filtered trip records used for the other summary stats.",
        "The status breakdown is not shown before a report is generated (i.e., only visible after the user clicks Generate).",
        "Existing summary stats and the trip details table in both report components remain unchanged.",
        "The layout remains responsive on both mobile and desktop."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DailyReport.tsx",
          "operation": "modify",
          "description": "After the report is generated (when filteredTrips is populated), compute three status counts by iterating over filteredTrips and counting records with status 'Pending', 'Complete', and 'Cancel'. In the summary stats table rows (after Number of Trips, Total Amount, Total Extra Charges, Grand Total), add three additional table rows with labels 'Pending:', 'Completed:', and 'Cancelled:' displaying the computed counts. Ensure these rows are only rendered when filteredTrips has data (i.e., after Generate is clicked) and maintain the same table styling and responsive layout as existing summary rows."
        },
        {
          "path": "frontend/src/components/DateRangeReport.tsx",
          "operation": "modify",
          "description": "After the report is generated (when filteredTrips is populated), compute three status counts by iterating over filteredTrips and counting records with status 'Pending', 'Complete', and 'Cancel'. In the summary stats table rows (after Number of Trips, Total Amount, Total Extra Charges, Grand Total), add three additional table rows with labels 'Pending:', 'Completed:', and 'Cancelled:' displaying the computed counts. Ensure these rows are only rendered when filteredTrips has data (i.e., after Generate is clicked) and maintain the same table styling and responsive layout as existing summary rows."
        }
      ]
    }
  ]
}